k6/home/result/load.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 scenario, 46 max VUs, 1m40s max duration (incl. graceful stop):
           * default: Up to 46 looping VUs for 1m10s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 03/46 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 03/46 VUs  0m01.0s/1m10.0s

running (0m02.0s), 05/46 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 05/46 VUs  0m02.0s/1m10.0s

running (0m03.0s), 07/46 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 07/46 VUs  0m03.0s/1m10.0s

running (0m04.0s), 09/46 VUs, 14 complete and 0 interrupted iterations
default   [   6% ] 09/46 VUs  0m04.0s/1m10.0s

running (0m05.0s), 11/46 VUs, 23 complete and 0 interrupted iterations
default   [   7% ] 11/46 VUs  0m05.0s/1m10.0s

running (0m06.0s), 14/46 VUs, 34 complete and 0 interrupted iterations
default   [   9% ] 14/46 VUs  0m06.0s/1m10.0s

running (0m07.0s), 16/46 VUs, 48 complete and 0 interrupted iterations
default   [  10% ] 16/46 VUs  0m07.0s/1m10.0s

running (0m08.0s), 18/46 VUs, 62 complete and 0 interrupted iterations
default   [  11% ] 18/46 VUs  0m08.0s/1m10.0s

running (0m09.0s), 20/46 VUs, 80 complete and 0 interrupted iterations
default   [  13% ] 20/46 VUs  0m09.0s/1m10.0s

running (0m10.0s), 22/46 VUs, 100 complete and 0 interrupted iterations
default   [  14% ] 22/46 VUs  0m10.0s/1m10.0s

running (0m11.0s), 23/46 VUs, 122 complete and 0 interrupted iterations
default   [  16% ] 23/46 VUs  0m11.0s/1m10.0s

running (0m12.0s), 23/46 VUs, 144 complete and 0 interrupted iterations
default   [  17% ] 23/46 VUs  0m12.0s/1m10.0s

running (0m13.0s), 23/46 VUs, 167 complete and 0 interrupted iterations
default   [  19% ] 23/46 VUs  0m13.0s/1m10.0s

running (0m14.0s), 23/46 VUs, 188 complete and 0 interrupted iterations
default   [  20% ] 23/46 VUs  0m14.0s/1m10.0s

running (0m15.0s), 23/46 VUs, 211 complete and 0 interrupted iterations
default   [  21% ] 23/46 VUs  0m15.0s/1m10.0s

running (0m16.0s), 23/46 VUs, 234 complete and 0 interrupted iterations
default   [  23% ] 23/46 VUs  0m16.0s/1m10.0s

running (0m17.0s), 23/46 VUs, 257 complete and 0 interrupted iterations
default   [  24% ] 23/46 VUs  0m17.0s/1m10.0s

running (0m18.0s), 23/46 VUs, 279 complete and 0 interrupted iterations
default   [  26% ] 23/46 VUs  0m18.0s/1m10.0s

running (0m19.0s), 23/46 VUs, 302 complete and 0 interrupted iterations
default   [  27% ] 23/46 VUs  0m19.0s/1m10.0s

running (0m20.0s), 23/46 VUs, 324 complete and 0 interrupted iterations
default   [  29% ] 23/46 VUs  0m20.0s/1m10.0s

running (0m21.0s), 25/46 VUs, 345 complete and 0 interrupted iterations
default   [  30% ] 25/46 VUs  0m21.0s/1m10.0s

running (0m22.0s), 27/46 VUs, 370 complete and 0 interrupted iterations
default   [  31% ] 27/46 VUs  0m22.0s/1m10.0s

running (0m23.0s), 29/46 VUs, 396 complete and 0 interrupted iterations
default   [  33% ] 29/46 VUs  0m23.0s/1m10.0s

running (0m24.0s), 32/46 VUs, 425 complete and 0 interrupted iterations
default   [  34% ] 32/46 VUs  0m24.0s/1m10.0s

running (0m25.0s), 34/46 VUs, 456 complete and 0 interrupted iterations
default   [  36% ] 34/46 VUs  0m25.0s/1m10.0s

running (0m26.0s), 36/46 VUs, 488 complete and 0 interrupted iterations
default   [  37% ] 36/46 VUs  0m26.0s/1m10.0s

running (0m27.0s), 39/46 VUs, 522 complete and 0 interrupted iterations
default   [  39% ] 39/46 VUs  0m27.0s/1m10.0s

running (0m28.0s), 41/46 VUs, 561 complete and 0 interrupted iterations
default   [  40% ] 41/46 VUs  0m28.0s/1m10.0s

running (0m29.0s), 43/46 VUs, 600 complete and 0 interrupted iterations
default   [  41% ] 43/46 VUs  0m29.0s/1m10.0s

running (0m30.0s), 45/46 VUs, 643 complete and 0 interrupted iterations
default   [  43% ] 45/46 VUs  0m30.0s/1m10.0s

running (0m31.0s), 46/46 VUs, 688 complete and 0 interrupted iterations
default   [  44% ] 46/46 VUs  0m31.0s/1m10.0s

running (0m32.0s), 46/46 VUs, 733 complete and 0 interrupted iterations
default   [  46% ] 46/46 VUs  0m32.0s/1m10.0s

running (0m33.0s), 46/46 VUs, 777 complete and 0 interrupted iterations
default   [  47% ] 46/46 VUs  0m33.0s/1m10.0s

running (0m34.0s), 46/46 VUs, 821 complete and 0 interrupted iterations
default   [  49% ] 46/46 VUs  0m34.0s/1m10.0s

running (0m35.0s), 46/46 VUs, 866 complete and 0 interrupted iterations
default   [  50% ] 46/46 VUs  0m35.0s/1m10.0s

running (0m36.0s), 46/46 VUs, 912 complete and 0 interrupted iterations
default   [  51% ] 46/46 VUs  0m36.0s/1m10.0s

running (0m37.0s), 46/46 VUs, 958 complete and 0 interrupted iterations
default   [  53% ] 46/46 VUs  0m37.0s/1m10.0s

running (0m38.0s), 46/46 VUs, 1002 complete and 0 interrupted iterations
default   [  54% ] 46/46 VUs  0m38.0s/1m10.0s

running (0m39.0s), 46/46 VUs, 1044 complete and 0 interrupted iterations
default   [  56% ] 46/46 VUs  0m39.0s/1m10.0s

running (0m40.0s), 46/46 VUs, 1088 complete and 0 interrupted iterations
default   [  57% ] 46/46 VUs  0m40.0s/1m10.0s

running (0m41.0s), 45/46 VUs, 1132 complete and 0 interrupted iterations
default   [  59% ] 45/46 VUs  0m41.0s/1m10.0s

running (0m42.0s), 43/46 VUs, 1177 complete and 0 interrupted iterations
default   [  60% ] 43/46 VUs  0m42.0s/1m10.0s

running (0m42.9s), 41/46 VUs, 1220 complete and 0 interrupted iterations
default   [  61% ] 41/46 VUs  0m43.0s/1m10.0s

running (0m43.9s), 39/46 VUs, 1258 complete and 0 interrupted iterations
default   [  63% ] 39/46 VUs  0m44.0s/1m10.0s

running (0m44.9s), 36/46 VUs, 1297 complete and 0 interrupted iterations
default   [  64% ] 36/46 VUs  0m45.0s/1m10.0s

running (0m45.9s), 34/46 VUs, 1329 complete and 0 interrupted iterations
default   [  66% ] 34/46 VUs  0m46.0s/1m10.0s

running (0m46.9s), 33/46 VUs, 1362 complete and 0 interrupted iterations
default   [  67% ] 33/46 VUs  0m47.0s/1m10.0s

running (0m47.9s), 29/46 VUs, 1395 complete and 0 interrupted iterations
default   [  69% ] 29/46 VUs  0m48.0s/1m10.0s

running (0m48.9s), 27/46 VUs, 1424 complete and 0 interrupted iterations
default   [  70% ] 27/46 VUs  0m49.0s/1m10.0s

running (0m49.9s), 25/46 VUs, 1451 complete and 0 interrupted iterations
default   [  71% ] 25/46 VUs  0m50.0s/1m10.0s

running (0m50.9s), 23/46 VUs, 1476 complete and 0 interrupted iterations
default   [  73% ] 23/46 VUs  0m51.0s/1m10.0s

running (0m51.9s), 23/46 VUs, 1499 complete and 0 interrupted iterations
default   [  74% ] 23/46 VUs  0m52.0s/1m10.0s

running (0m52.9s), 23/46 VUs, 1521 complete and 0 interrupted iterations
default   [  76% ] 23/46 VUs  0m53.0s/1m10.0s

running (0m53.9s), 23/46 VUs, 1544 complete and 0 interrupted iterations
default   [  77% ] 23/46 VUs  0m54.0s/1m10.0s

running (0m54.9s), 23/46 VUs, 1566 complete and 0 interrupted iterations
default   [  79% ] 23/46 VUs  0m55.0s/1m10.0s

running (0m55.9s), 23/46 VUs, 1586 complete and 0 interrupted iterations
default   [  80% ] 23/46 VUs  0m56.0s/1m10.0s

running (0m56.9s), 23/46 VUs, 1609 complete and 0 interrupted iterations
default   [  81% ] 23/46 VUs  0m57.0s/1m10.0s

running (0m57.9s), 23/46 VUs, 1632 complete and 0 interrupted iterations
default   [  83% ] 23/46 VUs  0m58.0s/1m10.0s

running (0m58.9s), 23/46 VUs, 1655 complete and 0 interrupted iterations
default   [  84% ] 23/46 VUs  0m59.0s/1m10.0s

running (0m59.9s), 23/46 VUs, 1678 complete and 0 interrupted iterations
default   [  86% ] 23/46 VUs  1m00.0s/1m10.0s

running (1m00.9s), 22/46 VUs, 1701 complete and 0 interrupted iterations
default   [  87% ] 22/46 VUs  1m01.0s/1m10.0s

running (1m02.0s), 20/46 VUs, 1721 complete and 0 interrupted iterations
default   [  89% ] 20/46 VUs  1m02.0s/1m10.0s

running (1m02.9s), 18/46 VUs, 1741 complete and 0 interrupted iterations
default   [  90% ] 18/46 VUs  1m03.0s/1m10.0s

running (1m03.9s), 16/46 VUs, 1758 complete and 0 interrupted iterations
default   [  91% ] 16/46 VUs  1m04.0s/1m10.0s

running (1m04.9s), 13/46 VUs, 1774 complete and 0 interrupted iterations
default   [  93% ] 13/46 VUs  1m05.0s/1m10.0s

running (1m05.9s), 11/46 VUs, 1787 complete and 0 interrupted iterations
default   [  94% ] 11/46 VUs  1m06.0s/1m10.0s

running (1m06.9s), 09/46 VUs, 1797 complete and 0 interrupted iterations
default   [  96% ] 09/46 VUs  1m07.0s/1m10.0s

running (1m07.9s), 06/46 VUs, 1806 complete and 0 interrupted iterations
default   [  97% ] 06/46 VUs  1m08.0s/1m10.0s

running (1m08.9s), 04/46 VUs, 1812 complete and 0 interrupted iterations
default   [  99% ] 04/46 VUs  1m09.0s/1m10.0s

running (1m09.9s), 02/46 VUs, 1816 complete and 0 interrupted iterations
default   [ 100% ] 02/46 VUs  1m10.0s/1m10.0s

running (1m10.8s), 00/46 VUs, 1818 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/46 VUs  1m10s

     ✓ logged in
     ✓ got profile

     checks.........................: 100.00% ✓ 3636      ✗ 0
     data_received..................: 925 kB  13 kB/s
     data_sent......................: 985 kB  14 kB/s
     http_req_blocked...............: avg=60.67µs  min=1.02µs   med=3.03µs  max=20.28ms  p(90)=6.03µs  p(95)=8.75µs
     http_req_connecting............: avg=50.98µs  min=0s       med=0s      max=9.55ms   p(90)=0s      p(95)=0s
   ✓ http_req_duration..............: avg=13.46ms  min=548.77µs med=12.47ms max=87.77ms  p(90)=17.05ms p(95)=19.64ms
       { expected_response:true }...: avg=13.46ms  min=548.77µs med=12.47ms max=87.77ms  p(90)=17.05ms p(95)=19.64ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 3636
     http_req_receiving.............: avg=955.72µs min=22.01µs  med=527µs   max=74.65ms  p(90)=1.09ms  p(95)=1.83ms
     http_req_sending...............: avg=23.53µs  min=5.37µs   med=16.01µs max=674.57µs p(90)=47.67µs p(95)=61.8µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=12.48ms  min=0s       med=11.79ms max=56.81ms  p(90)=15.65ms p(95)=18.11ms
     http_reqs......................: 3636    51.380353/s
     iteration_duration.............: avg=1.02s    min=1.01s    med=1.02s   max=1.1s     p(90)=1.03s   p(95)=1.03s
     iterations.....................: 1818    25.690177/s
     vus............................: 2       min=2       max=46
     vus_max........................: 46      min=46      max=46