k6/home/result/smoke.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s

running (10.4s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s

     ✓ logged in
     ✓ got profile

     checks.........................: 100.00% ✓ 20       ✗ 0
     data_received..................: 5.1 kB  491 B/s
     data_sent......................: 5.4 kB  523 B/s
     http_req_blocked...............: avg=1.06ms   min=2.15µs  med=3.58µs   max=21.22ms  p(90)=6.3µs    p(95)=1.07ms
     http_req_connecting............: avg=233.31µs min=0s      med=0s       max=4.66ms   p(90)=0s       p(95)=233.31µs
   ✓ http_req_duration..............: avg=16.54ms  min=14.06ms med=16.1ms   max=25.16ms  p(90)=18.47ms  p(95)=20.12ms
       { expected_response:true }...: avg=16.54ms  min=14.06ms med=16.1ms   max=25.16ms  p(90)=18.47ms  p(95)=20.12ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 20
     http_req_receiving.............: avg=764.39µs min=420.7µs med=493.65µs max=3.09ms   p(90)=879.14µs p(95)=3.06ms
     http_req_sending...............: avg=27.87µs  min=10.14µs med=19.16µs  max=166.52µs p(90)=38µs     p(95)=55.34µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=15.75ms  min=13.55ms med=15.14ms  max=24.65ms  p(90)=17.13ms  p(95)=19.52ms
     http_reqs......................: 20      1.929021/s
     iteration_duration.............: avg=1.03s    min=1.03s   med=1.03s    max=1.05s    p(90)=1.04s    p(95)=1.05s
     iterations.....................: 10      0.96451/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1